src/cf/Catalogs/НомераГТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НомераГТД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПроисхождения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПроисхожденияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиГТД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерЭСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПроисхождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КодПоиска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаВвозаНеРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/СпособыПроисхожденияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыПроисхожденияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕТТЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТ1</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НомераГТД/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если Не ПометкаУдаления Тогда
		ПроверитьДублиЭлемента(Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПорядковыйНомерТовара) Тогда
		ПорядковыйНомерТовара = НомерСтрокиГТД;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если СпособПроисхождения = Перечисления.СпособыПроисхожденияТоваров.СТ1 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Код");
		Если Не ЗначениеЗаполнено(Код) Тогда
			ТекстСообщения = НСтр("ru = 'Поле ""Номер сертификата"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"Код",
			,
			Отказ);
		КонецЕсли;
	ИначеЕсли СпособПроисхождения = Перечисления.СпособыПроисхожденияТоваров.ТС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Код");
		Если Не ЗначениеЗаполнено(Код) Тогда
			ТекстСообщения = НСтр("ru = 'Поле ""Номер заявления"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"Код",
			,
			Отказ);
		КонецЕсли;
	ИначеЕсли СпособПроисхождения = Перечисления.СпособыПроисхожденияТоваров.ЕТТЕАЭС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтранаПроисхождения");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ПроверитьДублиЭлемента(Отказ)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НомераГТД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НомераГТД КАК НомераГТД
	|ГДЕ
	|	НомераГТД.Ссылка <> &Ссылка
	|	И НЕ НомераГТД.ПометкаУдаления
	|	И НомераГТД.Код = &Код
	|	И НомераГТД.КодТНВЭД = &КодТНВЭД
	|	И НомераГТД.НомерСтрокиГТД = &НомерСтрокиГТД
	|	И НомераГТД.НаименованиеТовара = &НаименованиеТовара
	|	И НомераГТД.СтранаПроисхождения = &СтранаПроисхождения
	|	И НомераГТД.СпособПроисхождения = &СпособПроисхождения
	|	И НомераГТД.ПризнакПроисхождения = &ПризнакПроисхождения
	|	И НомераГТД.РегистрационныйНомерЭСФ = &РегистрационныйНомерЭСФ	
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("СтранаПроисхождения", СтранаПроисхождения);
	Запрос.УстановитьПараметр("КодТНВЭД", КодТНВЭД);
	Запрос.УстановитьПараметр("НомерСтрокиГТД", НомерСтрокиГТД);
	Запрос.УстановитьПараметр("НаименованиеТовара", НаименованиеТовара);
	Запрос.УстановитьПараметр("СпособПроисхождения", СпособПроисхождения);
	Запрос.УстановитьПараметр("ПризнакПроисхождения", ПризнакПроисхождения);
	Запрос.УстановитьПараметр("РегистрационныйНомерЭСФ", РегистрационныйНомерЭСФ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Аналогичный номер ГТД уже существует: %1'"),
			Выборка.Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			, // Поле
			,
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьАвтоНаименование()
	
	Если ЗначениеЗаполнено(СтранаПроисхождения) И ЗначениеЗаполнено(НомерСтрокиГТД) И ЗначениеЗаполнено(КодТНВЭД) Тогда
		Возврат СокрЛП(Код) + "/" + Формат(НомерСтрокиГТД, "ЧГ=0") + "/" + СтранаПроисхождения + "/" + СокрЛП(КодТНВЭД) + "/" + СпособПроисхождения + "/" + ПризнакПроисхождения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтранаПроисхождения) И ЗначениеЗаполнено(НомерСтрокиГТД) Тогда
		Возврат СокрЛП(Код) + "/" + Формат(НомерСтрокиГТД, "ЧГ=0") + "/" + СтранаПроисхождения + "/" + СпособПроисхождения + "/" + ПризнакПроисхождения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтранаПроисхождения) И ЗначениеЗаполнено(КодТНВЭД) Тогда
		Возврат СокрЛП(Код) + "/" + СтранаПроисхождения + "/" + СокрЛП(КодТНВЭД) + "/" + СпособПроисхождения + "/" + ПризнакПроисхождения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерСтрокиГТД) И ЗначениеЗаполнено(КодТНВЭД) Тогда
		Возврат СокрЛП(Код) + "/" + Формат(НомерСтрокиГТД, "ЧГ=0") + "/" + СокрЛП(КодТНВЭД) + "/" + СпособПроисхождения + "/" + ПризнакПроисхождения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерСтрокиГТД) Тогда
		Возврат СокрЛП(Код) + "/" + Формат(НомерСтрокиГТД, "ЧГ=0") + "/" + СпособПроисхождения + "/" + ПризнакПроисхождения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодТНВЭД) Тогда
		Возврат СокрЛП(Код) + "/" + СокрЛП(КодТНВЭД) + "/" + СпособПроисхождения + "/" + ПризнакПроисхождения;
	КонецЕсли;
	
	Возврат СокрЛП(Код) + "/" + СпособПроисхождения + "/" + ПризнакПроисхождения;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
